remote-results/bitbucket/bitbucket/2021-04-23_04-26-31/merged.yml
---
execution:
- concurrency: ${concurrency}
  hold-for: ${test_duration}
  ramp-up: ${ramp-up}
  scenario: ${load_executor}
- executor: selenium
  hold-for: ${test_duration}
  runner: pytest
  scenario: selenium
modules:
  consolidator:
    percentiles: []
    rtimes-len: 0
  jmeter:
    detect-plugins: true
    memory-xmx: 8G
    plugins:
    - bzm-parallel=0.4
    - bzm-random-csv=0.6
    - jpgc-casutg=2.5
    - jpgc-dummy=0.2
    - jpgc-ffw=2.0
    - jpgc-fifo=0.2
    - jpgc-functions=2.1
    - jpgc-json=2.6
    - jpgc-perfmon=2.1
    - jpgc-prmctl=0.4
    - jpgc-tst=2.4
    - jpgc-wsc=0.3
    - tilln-sshmon=1.0
    - jpgc-synthesis=2.2
    system-properties:
      httpsampler.ignore_failed_embedded_resources: 'true'
      java.rmi.server.hostname: localhost
      server.rmi.ssl.disable: true
    version: ${JMETER_VERSION}
  selenium:
    chromedriver:
      version: 89.0.4389.23
reporting:
- data-source: sample-labels
  module: junit-xml
scenarios:
  jmeter:
    properties:
      admin_login: ${admin_login}
      admin_password: '********'
      application_hostname: ${application_hostname}
      application_port: ${application_port}
      application_postfix: ${application_postfix}
      application_protocol: ${application_protocol}
      ssh_key_url: https://centaurus-datasets.s3.us-east-2.amazonaws.com/bitbucket/ssh/id_rsa
      tmp_dir: /tmp
      total_actions_per_hr: ${total_actions_per_hour}
    script: jmeter/bitbucket.jmx
  selenium:
    script: selenium_ui/bitbucket_ui.py
services:
- module: shellexec
  post-process:
  - python util/analytics/analytics.py bitbucket
  - python util/post_run/cleanup_results_dir.py
  prepare:
  - python util/pre_run/environment_checker.py
  - python util/pre_run/git_client_check.py
  - python util/data_preparation/bitbucket_prepare_data.py
  shutdown:
  - python util/post_run/jmeter_post_check.py
  - python util/jtl_convertor/jtls-to-csv.py kpi.jtl selenium.jtl
settings:
  aggregator: consolidator
  artifacts-dir: results/bitbucket/%Y-%m-%d_%H-%M-%S
  env:
    JMETER_VERSION: 5.4.1
    LANGUAGE: en_US.utf8
    WEBDRIVER_VISIBLE: false
    admin_login: admin
    admin_password: '********'
    allow_analytics: true
    application_hostname: bitbucket-loadbala-8ft2lasn6930-610129656.us-west-2.elb.amazonaws.com
    application_port: 80
    application_postfix: null
    application_protocol: http
    concurrency: 20
    load_executor: jmeter
    ramp-up: 10m
    secure: true
    test_duration: 50m
    total_actions_per_hour: 32700
  verbose: false